[
  {
    "Id": 1,
    "Title": "Web API and CORS",
    "Summary": "Recently I added a Web API project to an existing Visual Studio MVC solution.  It all went pretty smooth and everything worked as expected all the way to deploying to the DEV webserver environment...",
    "Post": "<p>A few weeks ago I was visiting with a family member that is studying to take the US Citizenship test and decided to help by creating a web application that can be used to study online.  Since the application is hosted on the Internet anyone can practice the questions and answers by going to the <a href='http://SouthToNorth.com' target='_blank'>SouthToNorth.com</a> website using a computer, a tablet, or a phone.</p><p>The U.S. Citizenship and Immigration Services provides us with 100 questions and answers that cover American Government, History, and Civics. The test is an oral test and the applicant will be asked 10 questions (taken from the 100 provided) from which at least 6 must be answered correctly in order to pass the test.</p><p> Maybe you know someone that is studying to take the test; if so, then send her/him the website link. I can tell you that I took the test and failed in more than one answer.  Go ahead and see how much you “really” know about U.S. history and government. </p><p>Enjoy,</p>",
    "Type": "Personal",
    "Date": "2013-04-23 05:16:12",
    "ImageURL": "./images/coffee.jpg"
  },
  {
    "Id": 2,
    "Title": "MS Band is not a Fashion Statement",
    "Summary": "It’s a technological statement.  I’ve been wearing the MS Band for twelve days now and I’m impressed with how much technology is packed into this single health band: built-in GPS, UV monitor, optical heart rate sensor, 3-axis accelerometer, gyrometer, ambient light sensor, skin temperature sensor, capacitive sensor, galvanic skin response, microphone, haptic vibration motor, Bluetooth, touch-enabled TFT full-color display, etc.",
    "Post": "<p>It’s a technological statement.  I’ve been wearing the MS Band for twelve days now and I’m impressed with how much technology is packed into this single health band: built-in GPS, UV monitor, optical heart rate sensor, 3-axis accelerometer, gyrometer, ambient light sensor, skin temperature sensor, capacitive sensor, galvanic skin response, microphone, haptic vibration motor, Bluetooth, touch-enabled TFT full-color display, etc., etc.; and, this my friends is only the hardware.  The software will blow your mind.</p><p>I use it every day to monitor my sleep, my heart rate, my exercise routines, the amount of calories I burn, my messages and my calendar reminders among many other things. The MS Band connects to my Lumia 925 Windows 8.1 phone via Bluetooth, and syncs with my Microsoft Health application providing me with plenty more information regarding my daily activities.  The phone app also manages my Band settings giving me options to customize the look, and allows me to add or delete notification tiles. And, oh yeah before I forget: the MS Band also syncs with Android and Apple phones.</p><p>There are plenty of reviews, pictures, and videos online that you can watch if you’re interested in finding out more.  Here is a link to a video that I like: Microsoft Band hands-on. If you want to read online reviews you will find that most of them will score the Band four-out-of-five stars. Here are a couple of reviewers that were not very impressed: <br/><br/>Microsoft Band: Killer on the inside, 'meh' on the outside<br/>Microsoft Band Review: Tracks Your Every Move, Then Breaks Your Heart</p><p>Is the MS Band perfect? No.  Can it be improved? Yes, and I’m sure that it will be. In my book it certainly deserves a five star rating.  Interested?  Find out more here: <a href='http://www.microsoft.com/microsoft-band/en-us' target='_blank'>microsoft-band</a> and here: <a href='http://www.microsoft.com/microsoft-band/en-us/get-started' target='_blank'>microsoft-band get-started</a>.</p><p>Time to monitor my sleep…</p>",
    "Type": "Hardware",
    "Date": "2014-11-16 03:58:53",
    "ImageURL": "./images/road.jpg"
  },
  {
    "Id": 3,
    "Title": "Getting to Know AngularJS",
    "Summary": "A while back I was introduced to AngularJS while reading Dan Wahlin’s blog post: AngularJS Fundamentals in 60ish Minutes.  When I watched the embedded video I was impressed with what I saw and decided to follow along and replicate what I was watching.  This exercised worked pretty good until I came across the section regarding routing – I wasn’t able to get it to work.  Soon afterwards my interest was diverted to other things but the seed had been planted.",
    "Post": "<p>A while back I was introduced to AngularJS while reading Dan Wahlin’s blog post: AngularJS Fundamentals in 60ish Minutes.  When I watched the embedded video I was impressed with what I saw and decided to follow along and replicate what I was watching.  This exercised worked pretty good until I came across the section regarding routing – I wasn’t able to get it to work.  Soon afterwards my interest was diverted to other things but the seed had been planted.</p><p>Fast forward to June of this year (2014).  I have been reading and watching training material (mostly for beginners) going on one month and I’m convinced that AngularJS is for me.  And if you are a front-end developer: AngularJS is for you also.</p><p>Don’t let another day go by without getting familiar with AngularJS.  I repeat: do not let another day go by without looking into AngularJS.  There are many online resources.  Allow me to recommend a few:</p><p>https://egghead.io/technologies/angularjs?order=ASC</p><p>http://codecondo.com/3-free-books-for-learning-angularjs/</p><p>http://campus.codeschool.com/courses/shaping-up-with-angular-js/intro</p><p>http://pluralsight.com/training/Courses/TableOfContents/angularjs-get-started</p><p>More information and resources:</p><p>https://github.com/jmcunningham/AngularJS-Learning</p><p>https://angularjs.org/</p><p>https://builtwith.angularjs.org/</p><p>Start today.</p><p>You can thank me later…</p>",
    "Type": "Technical",
    "Date": "July 21 2014",
    "ImageURL": "./images/shopping.jpg"
  },
  {
    "Id": 4,
    "Title": "Calling Web API with AngularJS",
    "Summary": "Been working with Web API for the entire week and decided to use angular as a test to see how hard/easy it would be to access the API from within an HTML page hosted on a different server.  Now, I’m new to AngularJS and also new to Web API so things do not come naturally to me.  Fortunately there is plenty of help online in the form of documentation, user groups, videos, etc.",
    "Post": "<p>Been working with Web API for the entire week and decided to use angular as a test to see how hard/easy it would be to access the API from within an HTML page hosted on a different server.  Now, I’m new to AngularJS and also new to Web API so things do not come naturally to me.  Fortunately there is plenty of help online in the form of documentation, user groups, videos, etc.</p><p>At the end it turned out to be easier than expected, and like everything else I’ve done with AngularJS I was blown away by the simplicity.  The Angular code that did the trick was the following:</p><blockquote><p>(function () {<br>'use strict';<br>var app = angular.module('app', []);<br>var MainController = function($scope, $http) {<br>        $scope.message = 'Testing Web API with AngularJS';<br>        $scope.simpleTest = function () {<br>getResults('<a href='https://web.archive.org/web/20160316164820/http://website/api/results%22);'>http://website/api/results');</a><br>        };<br>var onSuccess = function (response) {<br>            $scope.results = response.data;<br>        };<br>var onError = function (reason) {<br>            $scope.error = 'Could not fetch the results';<br>        };<br>var getResults = function (url) {<br>            $http.get(url)<br>            .then(onSuccess, onError);<br>        }<br>    };<br>app.controller('MainController', ['$scope', '$http', MainController]);<br>})();</p></blockquote><p>Where I would call the getResults() function using a ng-click directive.  I wish I could take credit for the code but like everything else that I do when learning something new: I copied it from a sample in http://plnkr.co</p><p>Learning something new is always fun…</p>",
    "Type": "Software Development",
    "Date": "September 16 2014",
    "ImageURL": "./images/coffee.jpg"
  },
  {
    "Id": 5,
    "Title": "On The Road Again",
    "Summary": "Excepteur reprehenderit sint exercitation ipsum consequat qui sit id velit elit. Velit anim eiusmod labore sit amet. Voluptate voluptate irure occaecat deserunt incididunt esse in. Sunt velit aliquip sunt elit ex nulla reprehenderit qui ut eiusmod ipsum do.",
    "Post": "<p>Excepteur reprehenderit sint exercitation ipsum consequat qui sit id velit elit. Velit anim eiusmod labore sit amet. Voluptate voluptate irure occaecat deserunt incididunt esse in. Sunt velit aliquip sunt elit ex nulla reprehenderit qui ut eiusmod ipsum do. Duis veniam reprehenderit aborum occaecat id proident nulla veniam. Duis enim deserunt voluptate aute veniam sint pariatur exercitation. Irure mollit est sit labore est deserunt pariatur duis aute laboris cupidatat. Consectetur consequat esse est sit veniam adipisicing ipsum enim irure.</p><p>Qui ullamco consectetur ute ugiat officia ullamco proident Lorem ad irure. Sint eu ut consectetur ut esse veniam laboris adipisicing aliquip minim anim labore commodo. Incididunt eu enim enim ipsum Lorem commodo tempor duis eu ullamco tempor elit occaecat sit. Culpa eu sit voluptate ullamco ad irure. Anim commodo aliquip llum ea nostrud commodo id culpa eu irure ut proident. Incididunt cillum excepteur incididunt mollit exercitation fugiat in. Magna irure laborum amet non ullamco aliqua eu. Aliquip adipisicing dolore irure culpa aute enim. Ullamco quis eiusmod ipsum laboris quis qui.</p><p>Cillum ullamco eu upidatat excepteur Lorem minim sint quis officia irure irure sint fugiat nostrud. Pariatur Lorem irure excepteur Lorem non irure ea fugiat adipisicing esse nisi ullamco proident sint. Consectetur qui quis cillum occaecat ullamco veniam et Lorem cupidatat pariatur. Labore officia ex aliqua et ccaecat velit dolor deserunt minim velit mollit irure. Cillum cupidatat enim officia non velit officia labore. Ut esse nisi voluptate etdeserunt enim laborum qui magna sint sunt cillum. Id exercitation labore sint ea labore adipisicing deserunt enim commodo consectetur reprehenderit enim. Est nim nostrud quis non fugiat duis cillum. Aliquip enim officia ad commodo id.</p>",
    "Type": "Personal",
    "Date": "2012-01-14T00:00:00",
    "ImageURL": "./images/road.jpg"
  }
]
